// **Задача 10**
// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

// Console.WriteLine("Введите число:");

// string number = Console.ReadLine();
// int N = Convert.ToInt32(number);
// if (N < 100 || N > 999) Console.WriteLine("не трех значное");
// else
// {
// int D = N/10%10;
// Console.WriteLine("Ваше число:"+N);
// Console.WriteLine("Второе число:"+D);
// }


// **Задача 13**
// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

// Console.WriteLine("Введите число:");

// string number = Console.ReadLine();
// int N = Convert.ToInt32(number);
// int D = 100;
// if (N < 100)
// {
//     Console.WriteLine("третьей цифры нет");
// }
    
// while (N>=100)
// {
//     D = N / 10;
//     if(D<=100)
//     {break;}
    
//     N = N / 10;    
//     // Console.WriteLine(N);
    
// }

// N = N % 10;
// Console.WriteLine("третья цифра:");
// Console.WriteLine(N);



// Задача 15
// Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

// Console.WriteLine("Введите день недели:");

// string number = Console.ReadLine();
// int N = Convert.ToInt32(number);


//     if (N ==6 || N ==7) Console.WriteLine("Weekend");
//     if (N < 7 && N > 1) Console.WriteLine("Работайте дальше");
//     if (N > 7 || N < 1) Console.WriteLine("Нет такого дня");
